Revit 2027 API
AnalysisDisplayStyle.SetMarkersAndTextSettings Method
 Set markers and text settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings markersAndTextSettings
)
Public Sub SetMarkersAndTextSettings (
	markersAndTextSettings As AnalysisDisplayMarkersAndTextSettings
)
public:
void SetMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings^ markersAndTextSettings
)
member SetMarkersAndTextSettings :
        markersAndTextSettings : AnalysisDisplayMarkersAndTextSettings -> unit
Parameters
markersAndTextSettings AnalysisDisplayMarkersAndTextSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  markers and text settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace